# -*- coding=utf-8 -*-



# 手机号码
CELL_PHONE_PATTERN = r'^((\+86)?([- ])?)?(|(13[0-9])|(14[0-9])|(15[0-9])|(17[0-9])|(18[0-9])|(19[0-9]))([- ])?\d{3}([- ])?\d{4}([- ])?\d{4}$'

# 中文字符正则
CHINESE_CHAR_PATTERN = '[\u4E00-\u9FA5]'

# 国内固定电话号码
DOMESTIC_FIXED_PHONE_PATTERN = '[0-9-()（）]{7,18}'

# 邮箱
#EMAIL_PATTERN = '^[*#\u4e00-\u9fa5 a-zA-Z0-9_.-]+@[a-zA-Z0-9-]+(\.[a-zA-Z0-9-]+)*\.[a-zA-Z0-9]{2,6}$'
EMAIL_PATTERN = r'[a-zA-Z0-9_.-]+@[a-zA-Z0-9_.-]+(?:\.[a-zA-Z0-9_.-]+)*\.[a-zA-Z0-9]{2,6}'

# HTML 标签
HTML_TAG_PATTERN = '<[^<]+?>'

# 中国身份证号
ID_CARD_PATTERN = r'^([1-9]\d{5}[12]\d{3}(0[1-9]|1[012])(0[1-9]|[12][0-9]|3[01])\d{3}[0-9xX])$'

# IP地址
IP_ADDRESS_PATTERN = '(25[0-5]|2[0-4]\d|[0-1]\d{2}|[1-9]?\d)\.(25[0-5]|2[0-4]\d|[0-1]\d{2}|[1-9]?\d)\.(25[0-5]|2[0-4]\d|[0-1]\d{2}|[1-9]?\d)\.(25[0-5]|2[0-4]\d|[0-1]\d{2}|[1-9]?\d)'

# 金额表达式
MONEY_PATTERN = '(\d[,，\d]*\.?\d+|[一二三四五六七八九十壹贰叁肆伍陆柒捌玖拾两][一二三四五六七八九十壹贰叁肆伍陆柒捌玖拾两〇O零百千万亿佰仟]*?)(余?)[百千万亿佰仟]*?美?(元|块钱)((\d[,.，\d]*|[一二三四五六七八九十壹贰叁肆伍陆柒捌玖拾两零][一二三四五六七八九十壹贰叁肆伍陆柒捌玖拾两〇O零百千万亿佰仟]*?)角)?((\d[,.\d]*|[>一二三四五六七八九十壹贰叁肆伍陆柒捌玖拾两零][一二三四五六七八九十壹贰叁肆伍陆柒捌玖拾两〇O零百千万亿佰仟]*?)分)?'

# 电话号码
PHONE_NUMBER_PATTERN_1 = '(?<!\d)(?:\+?86)?1(?:3\d{3}|5[^4\D]\d{2}|8\d{3}|7(?:[35678]\d{2}|4(?:0\d|1[0-2]|9\d))|9[189]\d{2}|66\d{2})\d{6}(?!\d)'  # 移动电话号码
PHONE_NUMBER_PATTERN_2 = '(?<!\d)\\d{2,3}-\\d{7,8}(?!\d)'  # 固话
PHONE_NUMBER_PATTERN_3 = '(?<!\d)\\(\\d{2,4}\\)\\d{7,8}(?!\d)'  # 固话
PHONE_NUMBER_PATTERN = '|'.join(
    [PHONE_NUMBER_PATTERN_1, PHONE_NUMBER_PATTERN_2, PHONE_NUMBER_PATTERN_3])

# 腾讯QQ号
QQ_PATTERN = '[1-9]([0-9]{5,11})'

# URL
URL_PATTERN = '(?:(?:https?|ftp|file)://|(?<![a-zA-Z\-\.])www\.)[-A-Za-z0-9+&@#/%?=~_|!:,.;]+[-A-Za-z0-9+&@#/%=~_|]'







